<br>**Join de Dataframes no PANDAS**

In [1]:
import pandas as pd
from db import DemoDB

In [3]:
# vamos utilizar algumas "tabelas" do DEMODB para testar os joins do Pandas
database = DemoDB()

Indexing schema. This will take a second...finished!

In [11]:
# vamos utilizar os dataframes album e artist
album = database.tables.Album.all()
print(album.head())
print("\n")
artist = database.tables.Artist.all()
print(artist.head())

   AlbumId                                  Title  ArtistId
0        1  For Those About To Rock We Salute You         1
1        2                      Balls to the Wall         2
2        3                      Restless and Wild         2
3        4                      Let There Be Rock         1
4        5                               Big Ones         3


   ArtistId               Name
0         1              AC/DC
1         2             Accept
2         3          Aerosmith
3         4  Alanis Morissette
4         5    Alice In Chains

In [14]:
# Quando fazemos um merge simples o pandas procura a primeira coluna com o mesmo nome nos 2 dfse faz o join com ela
# neste caso a coluna usada eh o ArtistId
album_artist = pd.merge(album,artist)
album_artist.head()

   AlbumId                                  Title  ArtistId       Name
0        1  For Those About To Rock We Salute You         1      AC/DC
1        4                      Let There Be Rock         1      AC/DC
2        2                      Balls to the Wall         2     Accept
3        3                      Restless and Wild         2     Accept
4        5                               Big Ones         3  Aerosmith

In [15]:
# eh possivel explicitar a coluna 
album_artist = pd.merge(album,artist,on="ArtistId")
album_artist.head()

   AlbumId                                  Title  ArtistId       Name
0        1  For Those About To Rock We Salute You         1      AC/DC
1        4                      Let There Be Rock         1      AC/DC
2        2                      Balls to the Wall         2     Accept
3        3                      Restless and Wild         2     Accept
4        5                               Big Ones         3  Aerosmith

In [19]:
# para exemplificar o exemplo de join quando temos colunas de nome diferentes vamos alterar a coluna ArtistId de um dos dataframes
album.rename(columns={'ArtistId':'artist_id'},inplace=True)
album.columns

Index(['AlbumId', 'Title', 'artist_id'], dtype='object')

In [30]:
# fazendo o join com os 2 campos com nomes diferentes
album_artist = pd.merge(album,artist,left_on='artist_id',right_on='ArtistId')
album_artist.head()

,AlbumId,Title,artist_id,ArtistId,Name
0,1,For Those About To Rock We Salute You,1,1,AC/DC
1,4,Let There Be Rock,1,1,AC/DC
2,2,Balls to the Wall,2,2,Accept
3,3,Restless and Wild,2,2,Accept
4,5,Big Ones,3,3,Aerosmith

In [31]:
# o join e feito mas os campos de join estao duplicados ... agora e so escolher 1 das duplicatas e excluir
album_artist.drop('artist_id',axis=1,inplace=True)
album_artist.head()

   AlbumId                                  Title  ArtistId       Name
0        1  For Those About To Rock We Salute You         1      AC/DC
1        4                      Let There Be Rock         1      AC/DC
2        2                      Balls to the Wall         2     Accept
3        3                      Restless and Wild         2     Accept
4        5                               Big Ones         3  Aerosmith

<br>**Tipos de Joins**

In [36]:
# supondo 2 dataframes com as seguintes informacoes

alunos1 = pd.DataFrame({'nome':['Teresa','Maria','Penelope'],'nota': [10,7,9]})
alunos2 = pd.DataFrame({'nome' : ['Felipe','Gabriel','Penelope'],'conceito':['A','B','C']})

In [38]:
# ao fazer o merge default (how=inner) utilizando o campo nome temos teremos so os dados de interseccao entre os 2 dataframes
pd.merge(alunos1,alunos2)

       nome  nota conceito
0  Penelope     9        C

In [39]:
pd.merge(alunos1,alunos2,how='inner')

       nome  nota conceito
0  Penelope     9        C

In [40]:
# para obtermos um join de todos os registros e preciso alterar o tipo do join para outer
pd.merge(alunos1,alunos2,how='outer')

       nome  nota conceito
0    Teresa  10.0      NaN
1     Maria   7.0      NaN
2  Penelope   9.0        C
3    Felipe   NaN        A
4   Gabriel   NaN        B

In [41]:
# para que o join so tenha os elementos a esquerda eh preciso alterar o tipo de join para left
pd.merge(alunos1,alunos2,how='left')

       nome  nota conceito
0    Teresa    10      NaN
1     Maria     7      NaN
2  Penelope     9        C

In [42]:
# mesmo principio para os elementos a direita ( usar right)
pd.merge(alunos1,alunos2,how='right')

       nome  nota conceito
0  Penelope   9.0        C
1    Felipe   NaN        A
2   Gabriel   NaN        B